[
  {
    "id": "1",
    "title": "O Programador Apaixonado",
    "author": "Fowler Chad",
    "publisher": "Casa do Codigo",
    "genre": "Tecnologia",
    "year": 2014,
    "pages": 255,
    "language": "Português",
    "rating": 5,
    "synopsis": "Para ter sucesso no mercado de TI atual, é preciso ver sua carreira como se fosse um negócio. Neste livro, você vai aprender a empreender com a sua carreira e levá-la para o caminho que você escolheu: o do sucesso. Neste livro, Chad Fowler, famoso desenvolvedor de software e autor de diversos livros, ensina a construir sua carreira na área de desenvolvimento, passo a passo, seguindo o mesmo caminho de que se você estivesse criando e vendendo um produto. Afinal de contas, suas habilidades são um produto",
    "cover": "https://m.media-amazon.com/images/I/81dBiDT7qTL._SL1500_.jpg",
    "status": "LENDO"
  },
  {
    "id": "2",
    "title": "Entendendo Algoritmos",
    "author": "Aditya Y. Bhargava",
    "publisher": "Novatec",
    "genre": "Tecnologia",
    "year": 2017,
    "pages": 264,
    "language": "Português",
    "rating": 5,
    "synopsis": "O livro Entendendo Algoritmos apresenta uma abordagem agradável para esse tópico essencial da ciência da computação. Nele, você aprenderá como aplicar algoritmos comuns nos problemas de programação enfrentados diariamente. Você começará com tarefas básicas como a ordenação e a pesquisa. Com a prática, você enfrentará problemas mais complexos, como a compressão de dados e a inteligência artificial. Cada exemplo é apresentado em detalhes e inclui diagramas e códigos completos em Python. Ao final deste livro, você terá dominado algoritmos amplamente aplicáveis e saberá quando e onde utilizá-los...",
    "cover": "https://m.media-amazon.com/images/I/71Vkg7GfPFL._SL1296_.jpg",
    "status": "LIDO"
  },
  {
    "id": "3",
    "title": "O Pequeno Príncipe",
    "author": "Antoine de Saint-Exupéry",
    "publisher": "HarperCollins",
    "genre": "Infantil",
    "year": 2018,
    "pages": 96,
    "language": "Português",
    "rating": 5,
    "synopsis": "Um livro para todos os públicos, O pequeno príncipe é uma obra atemporal, com metáforas pertinentes e aprendizados sobre afeto, sonhos, esperança e tudo aquilo que é invisível aos olhos. ",
    "cover": "https://m.media-amazon.com/images/I/81TmOZIXvzL._SL1500_.jpg",
    "status": "QUERO-LER"
  },
  {
    "id": "4",
    "title": "Iracema",
    "author": "Jose de Alencar",
    "publisher": "Principis",
    "genre": "Literatura Brasileira",
    "year": 2022,
    "pages": 128,
    "language": "Português",
    "rating": 3,
    "synopsis": "A pitiguara Iracema, a 'virgem dos lábios de mel', encontra nas florestas da orla cearense o português Martim. Uma espécie de poema em prosa, o conturbado amor proibido mostra o conflito histórico entre tribos indígenas e europeus e revela, com lirismo e aventura, a contradição e o embate entre civilizações.",
    "cover": "https://m.media-amazon.com/images/I/71LCDi6E2oL._SL1500_.jpg",
    "status": "QUERO-LER"
  },
  {
    "id": "5",
    "title": "Dom Casmurro",
    "author": "Machado de Assis",
    "publisher": "Principis",
    "genre": "Literatura Brasileira",
    "year": 1899,
    "pages": 240,
    "language": "Português",
    "rating": 5,
    "synopsis": "O livro é narrado por Bentinho, que, na velhice, relata sua história e a de seu grande amor, Capitu...",
    "cover": "https://m.media-amazon.com/images/I/61x1ZHomWUL._SL1200_.jpg",
    "status": "LIDO"
  },
  {
    "id": "6",
    "title": "1984",
    "author": "George Orwell",
    "publisher": "Companhia das Letras",
    "genre": "Ficção",
    "year": 1949,
    "pages": 416,
    "language": "Português",
    "rating": 5,
    "synopsis": "Winston Smith trabalha para o Ministério da Verdade em Londres, capital da Oceânia. Sua função é reescrever a história para adequá-la às necessidades do Partido. Mas Winston guarda memórias da época anterior à revolução e isso o torna um criminoso. Sua luta solitária contra a opressão do Partido único, porém, não é a única coisa que o preocupa. O que fazer com Julia, a jovem que vai contra as regras do Partido ao entregar-lhe uma carta de amor?",
    "cover": "https://m.media-amazon.com/images/I/819js3EQwbL._SL1500_.jpg",
    "status": "LIDO"
  },
  {
    "id": "7",
    "title": "Sapiens: Uma Breve História da Humanidade",
    "author": "Yuval Noah Harari",
    "publisher": "L&PM",
    "genre": "História",
    "year": 2011,
    "pages": 464,
    "language": "Português",
    "rating": 4,
    "synopsis": "Na obra, Harari delineia brevemente a história da humanidade, desde os primeiros humanos a caminhar sobre a Terra até os avanços tecnológicos da modernidade. O livro foca em três grandes revoluções que afetaram os humanos: a Revolução Cognitiva (70.000 a.C.), a Revolução Agrícola (10.000 a.C.) e a Revolução Científica (1500 d.C.).",
    "cover": "https://m.media-amazon.com/images/I/71Vhb0xyuaL._SL1000_.jpg",
    "status": "LENDO"
  },
  {
    "id": "8",
    "title": "O Hobbit",
    "author": "J.R.R. Tolkien",
    "publisher": "HarperCollins",
    "genre": "Fantasia",
    "year": 1937,
    "pages": 336,
    "language": "Português",
    "rating": 5,
    "synopsis": "Bilbo Bolseiro era um hobbit que vivia confortavelmente em sua toca no subterrâneo até o dia em que o mago Gandalf bate à sua porta. A partir de então, toda sua vida pacata e campestre sofreria uma reviravolta. Quase sem saber como, Bilbo se vê obrigado a participar de uma expedição em companhia de treze anões que têm o objetivo de recuperar o tesouro de seus ancestrais, guardado sob a Montanha Solitária pelo temível dragão Smaug.",
    "cover": "https://m.media-amazon.com/images/I/712cDO7d73L._SL1000_.jpg",
    "status": "LIDO"
  },
  {
    "id": "9",
    "title": "Clean Code",
    "author": "Robert C. Martin",
    "publisher": "Alta Books",
    "genre": "Programação",
    "year": 2008,
    "pages": 464,
    "language": "Português",
    "rating": 5,
    "synopsis": "Mesmo um código ruim pode funcionar. Mas se ele não for limpo, pode acabar com uma empresa de desenvolvimento. Perdem-se a cada ano horas incontáveis e recursos importantes devido a um código mal escrito. Mas não precisa ser assim. O renomado especialista em software, Robert C. Martin, apresenta um paradigma revolucionário com Código limpo: Habilidades Práticas do Agile Software.",
    "cover": "https://m.media-amazon.com/images/I/515iEcDr1GL._SL1000_.jpg",
    "status": "QUERO-LER"
  },
  {
    "id": "10",
    "title": "O Poder do Hábito",
    "author": "Charles Duhigg",
    "publisher": "Objetiva",
    "genre": "Autoajuda",
    "year": 2012,
    "pages": 408,
    "language": "Português",
    "rating": 4,
    "synopsis": "Durante os últimos dois anos, uma jovem transformou quase todos os aspectos de sua vida. Parou de fumar, correu uma maratona e foi promovida. Em um laboratório em Duke, neurobiologistas descobriram como e por que os hábitos funcionam e como podem ser mudados. Dividido em três partes, O poder do hábito foca na ciência dos hábitos na vida das pessoas, das empresas e da sociedade.",
    "cover": "https://m.media-amazon.com/images/I/81YkqyaFVEL._SL1500_.jpg",
    "status": "PAUSADO"
  },
  {
    "id": "11",
    "title": "Cem Anos de Solidão",
    "author": "Gabriel García Márquez",
    "publisher": "Record",
    "genre": "Realismo Mágico",
    "year": 1967,
    "pages": 432,
    "language": "Português",
    "rating": 5,
    "synopsis": "Cem anos de solidão é a obra-prima de Gabriel García Márquez e uma das principais realizações artísticas da literatura de nosso tempo. O romance narra a saga dos Buendía ao longo de um século na fictícia cidade de Macondo. É uma das obras mais traduzidas e lidas em língua espanhola.",
    "cover": "https://m.media-amazon.com/images/I/91TvVQS7loL._SL1500_.jpg",
    "status": "LENDO"
  },
  {
    "id": "12",
    "title": "Steve Jobs",
    "author": "Walter Isaacson",
    "publisher": "Companhia das Letras",
    "genre": "Biografia",
    "year": 2011,
    "pages": 656,
    "language": "Português",
    "rating": 4,
    "synopsis": "Esta é a biografia definitiva de Steve Jobs, o fundador da Apple, escrita com a sua colaboração. Isaacson realizou mais de quarenta entrevistas com Jobs nos últimos dois anos de sua vida, além de entrevistas com mais de cem pessoas da família, amigos, adversários, concorrentes e colegas.",
    "cover": "https://m.media-amazon.com/images/I/81VStYnDGrL._SL1500_.jpg",
    "status": "QUERO-LER"
  },
  {
    "id": "13",
    "title": "Duna",
    "author": "Frank Herbert",
    "publisher": "Aleph",
    "genre": "Ficção Científica",
    "year": 1965,
    "pages": 688,
    "language": "Português",
    "rating": 5,
    "synopsis": "Uma estonteante mistura de aventura e misticismo, ecologia e política, este romance ganhador dos prêmios Hugo e Nebula deu início a uma das mais épicas histórias de toda a ficção científica. Duna é um triunfo da imaginação, que influenciará a literatura para sempre.",
    "cover": "https://m.media-amazon.com/images/I/81zN7udGRUL._SL1500_.jpg",
    "status": "LENDO"
  },
  {
    "id": "14",
    "title": "Orgulho e Preconceito",
    "author": "Jane Austen",
    "publisher": "Penguin Classics",
    "genre": "Romance",
    "year": 1813,
    "pages": 432,
    "language": "Português",
    "rating": 4,
    "synopsis": "Orgulho e preconceito é um romance da escritora britânica Jane Austen. Publicado em 1813, é uma das obras mais populares da literatura inglesa. A história acompanha o desenvolvimento do relacionamento entre Elizabeth Bennet, filha de um pequeno proprietário rural, e Fitzwilliam Darcy, um rico aristocrata.",
    "cover": "https://m.media-amazon.com/images/I/71Q1tPupKjL._SL1000_.jpg",
    "status": "ABANDONADO"
  },
  {
    "id": "16",
    "title": "Lean Startup",
    "author": "Eric Ries",
    "publisher": "Lua de Papel",
    "genre": "Negócios",
    "year": 2011,
    "pages": 280,
    "language": "Português",
    "rating": 4,
    "synopsis": "A startup enxuta é um novo método para desenvolver negócios e produtos. Combinando ideias do movimento lean manufacturing, design thinking, customer development e desenvolvimento ágil de software, está mudando a maneira como as empresas são criadas e novos produtos são lançados.",
    "cover": "https://m.media-amazon.com/images/I/81-QB7nDh4L._SL1500_.jpg",
    "status": "QUERO-LER"
  },
  {
    "id": "17",
    "title": "O Mundo de Sofia",
    "author": "Jostein Gaarder",
    "publisher": "Companhia das Letras",
    "genre": "Filosofia",
    "year": 1991,
    "pages": 560,
    "language": "Português",
    "rating": 3,
    "synopsis": "O mundo de Sofia é ao mesmo tempo um romance e um livro de iniciação à filosofia. A protagonista é Sofia, uma garota de 14 anos que começa a receber cartas anônimas com perguntas intrigantes como 'Quem é você?' e 'De onde vem o mundo?'. A partir dessas cartas, Sofia embarca em uma jornada pelo pensamento humano.",
    "cover": "https://m.media-amazon.com/images/I/91U9VjiT-xL.jpg",
    "status": "PAUSADO"
  },
  {
    "id": "19",
    "title": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "publisher": "G.P. Putnam's Sons",
    "genre": "Ficção",
    "year": 2018,
    "pages": 384,
    "language": "Inglês",
    "rating": 4,
    "synopsis": "For years, rumors of the 'Marsh Girl' have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say.",
    "cover": "https://m.media-amazon.com/images/I/81O55EjYhLL._SL1500_.jpg",
    "status": "LENDO"
  },
  {
    "id": "20",
    "title": "Harry Potter e a Pedra Filosofal",
    "author": "J.K. Rowling",
    "publisher": "Rocco",
    "genre": "Fantasia",
    "year": 1997,
    "pages": 264,
    "language": "Português",
    "rating": 5,
    "synopsis": "Harry Potter tem apenas onze anos quando fica órfão e é deixado aos cuidados dos tios que não o tratam bem. Certo dia, Harry descobre ser um bruxo e é convidado para estudar na Escola de Magia e Bruxaria de Hogwarts. Lá ele conhece vários colegas e aprende feitiços, poções e como jogar quadribol.",
    "cover": "https://m.media-amazon.com/images/I/81ibfYk4qmL._SL1500_.jpg",
    "status": "LIDO"
  }
]